In [7]:
import sqlite3

db = sqlite3.connect('IMDB.sqlite') #method returns an object
db

In [4]:
db = sqlite3.connect('IMDB_1.sqlite') #method returns an object
db

In [8]:
db = sqlite3.connect('School.sqlite')
db

In [9]:
cur = db.cursor()
cur

In [8]:
sql_query = 'Create table Student (RollNumber int Primary key, Name Text, Age int)'
cur.execute(sql_query)

In [13]:
cur.execute('Insert into Student values (101, "Ayush", 20)')

IntegrityError: UNIQUE constraint failed: Student.RollNumber

In [14]:
db.commit()

In [15]:
cur.execute('Insert into Student values (102, "Aman", 21)')
db.commit()

In [16]:
db.close()

In [20]:
cur.execute('Insert into Student values (103, "Mohit", 24)')
db.commit()

In [21]:
rollNumber = 104
Name = "Ankur"
Age = 23
cur.execute('Insert into Student values(?, ?, ?)', (rollNumber, Name, Age))
db.commit()

In [23]:
# inserting multiple records
values = [(105, "Nidhi", 20), (106,"Manisha", 21), (107, "Ankush", 23)]
cur.executemany('Insert into Student values(?, ?, ?)', values)

In [24]:
db.commit()

In [25]:
cur.execute('Update Student set Age = 19 where RollNumber = 101')
db.commit()

In [30]:
cur.execute('Select * from Student')

In [31]:
for row in cur:
    print(row)

(101, 'Ayush', 19)
(102, 'Aman', 21)
(103, 'Mohit', 24)
(104, 'Ankur', 23)
(105, 'Nidhi', 20)
(106, 'Manisha', 21)
(107, 'Ankush', 23)

In [34]:
cur.execute('Select * from Student') #fetching all the rows to which cur is pointing 
print(cur.fetchone())
print(cur.fetchone())

(101, 'Ayush', 19)
(102, 'Aman', 21)

In [36]:
cur.execute('Select * from Student') 
print(cur.fetchmany(3))

[(101, 'Ayush', 19), (102, 'Aman', 21), (103, 'Mohit', 24)]

In [39]:
cur.execute('Select * from Student where RollNumber > 103') 
print(cur.fetchall())

[(104, 'Ankur', 23), (105, 'Nidhi', 20), (106, 'Manisha', 21), (107, 'Ankush', 23)]

### Sqlite with Pandas

In [4]:
import pandas as pd

In [10]:
data = pd.read_sql_query("Select * from Student", db)
data

   RollNumber     Name  Age
0         101    Ayush   19
1         102     Aman   21
2         103    Mohit   24
3         104    Ankur   23
4         105    Nidhi   20
5         106  Manisha   21
6         107   Ankush   23

In [12]:
data[data['Age'] == 21]

   RollNumber     Name  Age
1         102     Aman   21
5         106  Manisha   21

In [14]:
data = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Ayush", "Maths", 30000], [203, "Akhil", "Hindi", 40000]],
                   columns = ['ID', 'Name', 'Course', 'Salary'])
data

    ID   Name   Course  Salary
0  201   Aman  English   20000
1  202  Ayush    Maths   30000
2  203  Akhil    Hindi   40000

In [15]:
data.to_sql("Faculty", db)

In [16]:
#updating a table
data = pd.read_sql_query('Select * from Student', db)
data['Address'] = "Test"
data.to_sql('Student', db, if_exists = "replace")

### IMDB database

In [3]:
import sqlite3
import pandas as pd
db = sqlite3.connect('IMDB.sqlite')

In [2]:
cur = db.cursor()

In [41]:
data = pd.read_sql_query('Select * from IMDB', db)
# data

In [51]:
data= pd.read_sql_query('Select * from genre', db)
data[data['genre'] != '']
# data

    Movie_id      genre
0      36809  Biography
1      30114  Adventure
2      37367     Comedy
3      49473     Comedy
4      14867      Drama
5      33832     Action
6      31722      Drama
7      25398      Drama
8      10099  Animation
9      25281     Comedy
10     43358      Drama
11     36798      Drama
12     10617      Drama
13     49590     Action
14     12560     Action
15     31370     Comedy
16     48626  Biography
17     38131      Drama
18     34191  Biography
19     20341     Action
20     18506     Action
21     38960  Animation
22     43526      Drama
23     10015      Drama
24     11971      Drama
25     31332     Action
26     22607      Crime
27     33884     Action
28     21508      Crime
29     30161      Drama
..       ...        ...
307    13627      Drama
308    17294    Romance
309    41048      Music
310    47323   Thriller
311    28910    History
312    28919     Sci-Fi
313    38626    Fantasy
314    14813    History
315    42419     Comedy
316    34386    Romance
318    21538      Drama
322    44160      Drama
323    28130    Mystery
324    22401      Drama
328    41963    Mystery
329    45458   Thriller
331    47074  Adventure
332    40310      Drama
333    24887     Sci-Fi
335    29441   Thriller
337    40287    Romance
338    32701   Thriller
339    35004      Crime
340    40832     Comedy
341    44316    Western
344    17545      Sport
347    10023     Comedy
348    27783     Sci-Fi
349    42294     Sci-Fi
350    32217     Comedy

[310 rows x 2 columns]

In [55]:
data = pd.read_sql_query('Select genre, count(Movie_id) from genre where length(genre) > 0 group by genre', db)
data
# print(data.shape[0])
# print(data['genre'], data['count(Movie_id)'])

for i in range(data.shape[0]):
    print(data['genre'][i], data['count(Movie_id)'][i])

Action 33
Adventure 43
Animation 13
Biography 21
Comedy 31
Crime 11
Drama 77
Family 3
Fantasy 7
History 6
Horror 2
Music 3
Musical 1
Mystery 7
Romance 13
Sci-Fi 18
Sport 3
Thriller 14
War 2
Western 2

In [10]:
# st = 
data = pd.read_sql_query("select Movie_id, MAX(s) from (select Movie_id, (Domestic+ Worldwide) as s from earning group by Movie_id, Domestic, Worldwide)", db)
data = pd.read_sql_query("select Rating from IMDB where Movie_id = 38626", db)
data

   Rating
0     8.1

In [13]:
#Max Votes
IMDB_data = pd.read_sql_query('select * from IMDB', db)
print(IMDB_data[IMDB_data['TotalVotes'] == max(IMDB_data['TotalVotes'])]['Title'].values[0])
print(IMDB_data[IMDB_data['TotalVotes'] == max(IMDB_data['TotalVotes'])]['Rating'].values[0])

Inception (2010)
8.8

In [80]:
# max runtime
data = pd.read_sql_query('select * from IMDB', db)
movie = data['Title']
# print(movie)
temp = data['Runtime']
temp.replace('', '0', inplace = True)
temp = temp.str.split(' ')
for i in range(temp.shape[0]):
    temp[i] = temp[i][0]

temp = temp.astype(float)
idx = temp.idxmax()
print(movie[idx], int(temp[idx]))

The Wolf of Wall Street (2013) 180

In [43]:
#max profit movie
imdb = pd.read_sql_query('select * from IMDB',db)
earning = pd.read_sql_query('select * from earning',db)
imdb_earning = pd.merge(imdb, earning, on = 'Movie_id')
imdb_earning['Budget'].replace('', 0, inplace = True)
imdb_earning['Total'] = imdb_earning['Domestic'] + imdb_earning['Worldwide']
imdb_earning['Budget'] = imdb_earning['Budget'].astype(float)
# print(type(imdb_earning['Total'][0]))
# print(type(imdb_earning['Budget'][0]))
imdb_earning['Total'] = imdb_earning['Total'] - imdb_earning['Budget']
maxi = max(imdb_earning['Total'])
imdb_earning[imdb_earning['Total'] == maxi]['Title'].values[0]

'Star Wars: The Force Awakens\xa0(2015)'

In [81]:
db.close()